tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "keith/formulae"
tap "yt-dlp/taps"
brew "age"
brew "antidote"
brew "zstd"
brew "aria2"
brew "atool"
brew "autoconf-archive"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "borgbackup"
brew "borgmatic"
brew "ccache"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cpanminus"
brew "difftastic"
brew "direnv"
brew "e2fsprogs"
brew "elixir"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gcc"
brew "gcc@11"
brew "genext2fs"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "htop"
brew "httpie"
brew "hub"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "just"
brew "llvm"
brew "make"
brew "mas"
brew "ninja"
brew "meson"
brew "mosh"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "opam"
brew "pam-reattach"
brew "parallel"
brew "perl"
brew "pgformatter"
brew "pipenv"
brew "pipx"
brew "postgresql@14"
brew "pre-commit"
brew "python@3.10"
brew "qemu"
brew "qt"
brew "r"
brew "rbenv"
brew "rclone"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "scons"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "swig"
brew "taplo"
brew "tealdeer"
brew "texinfo"
brew "tig"
brew "tmux"
brew "topgrade"
brew "tree"
brew "typst"
brew "vcpkg"
brew "vim"
brew "wget"
brew "xcodes"
brew "yt-dlp"
brew "zbar"
brew "zsh"
brew "zx"
brew "keith/formulae/dyld-shared-cache-extractor"
cask "adobe-digital-editions"
cask "alt-tab"
cask "appcleaner"
cask "calibre"
cask "discord"
cask "firefox"
cask "font-cascadia-code"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-recursive-code"
cask "font-symbols-only-nerd-font"
cask "fontsmoothingadjuster"
cask "ghidra"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboardcleantool"
cask "kitty"
cask "knockknock"
cask "librewolf"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "miniforge"
cask "obs"
cask "orbstack"
cask "osu"
cask "postman"
cask "rapidapi"
cask "setapp"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "alefragnani.project-manager"
vscode "angular.ng-template"
vscode "batisteo.vscode-django"
vscode "bierner.comment-tagged-templates"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kevinrose.vsc-python-indent"
vscode "kleinesfilmroellchen.serenity-dsl-syntaxhighlight"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-selfhost-test-provider"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
vscode "ocamllabs.ocaml-platform"
vscode "orta.vscode-jest"
vscode "phoenixframework.phoenix"
vscode "pkief.material-icon-theme"
vscode "rdebugger.r-debugger"
vscode "redhat.java"
vscode "reditorsupport.r"
vscode "ritwickdey.liveserver"
vscode "runem.lit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wholroyd.jinja"
vscode "xaver.clang-format"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "ziglang.vscode-zig"
vscode "ziyasal.vscode-open-in-github"
