tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "yt-dlp/taps"
brew "age"
brew "antidote"
brew "zstd"
brew "python@3.12"
brew "icu4c@76"
brew "aria2"
brew "atool"
brew "mandoc"
brew "awscli"
brew "bash"
brew "libgit2@1.7"
brew "bat"
brew "borgbackup"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "difftastic"
brew "eza"
brew "fastfetch"
brew "fd"
brew "gcc"
brew "open-mpi"
brew "rubberband"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fontforge"
brew "fzf"
brew "gdb"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "mosh"
brew "nasm"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "netperf"
brew "node"
brew "parallel"
brew "pipenv"
brew "pipx"
brew "pre-commit"
brew "r"
brew "rclone"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "tealdeer"
brew "tmux"
brew "topgrade"
brew "vim"
brew "yt-dlp"
brew "zx"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "ziyasal.vscode-open-in-github"
