tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "keith/formulae"
tap "yt-dlp/taps"
brew "age"
brew "antidote"
brew "zstd"
brew "aria2"
brew "atool"
brew "autoconf-archive"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "borgbackup"
brew "borgmatic"
brew "ccache"
brew "chezmoi"
brew "clang-format"
brew "cling"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cpanminus"
brew "difftastic"
brew "e2fsprogs"
brew "elixir"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "gcc@11"
brew "genext2fs"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "just"
brew "mas"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nmap"
brew "opam"
brew "parallel"
brew "perl"
brew "pipenv"
brew "pipx"
brew "postgresql@14"
brew "pre-commit"
brew "python@3.10"
brew "qemu"
brew "qt"
brew "r"
brew "rbenv"
brew "rclone"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "scons"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "swig"
brew "tealdeer"
brew "texinfo"
brew "tig"
brew "tmux"
brew "topgrade"
brew "tree"
brew "typst"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "zbar"
brew "zsh"
brew "zx"
brew "keith/formulae/dyld-shared-cache-extractor"
cask "adobe-digital-editions"
cask "alt-tab"
cask "appcleaner"
cask "brave-browser"
cask "calibre"
cask "discord"
cask "docker"
cask "eclipse-java"
cask "eloston-chromium"
cask "firefox"
cask "font-cascadia-code-pl"
cask "font-fantasque-sans-mono"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-input"
cask "font-iosevka"
cask "font-iosevka-curly"
cask "font-iosevka-nerd-font"
cask "font-iosevka-ss17"
cask "font-iosevka-term-nerd-font"
cask "font-mononoki"
cask "font-recursive"
cask "font-recursive-code"
cask "font-smoothing-adjuster"
cask "font-symbols-only-nerd-font"
cask "ghidra"
cask "google-chrome"
cask "hammerspoon"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboardcleantool"
cask "kitty"
cask "knockknock"
cask "librewolf"
cask "mactex"
cask "mambaforge"
cask "obs"
cask "osu"
cask "postman"
cask "rapidapi"
cask "setapp"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
vscode "alefragnani.project-manager"
vscode "Angular.ng-template"
vscode "batisteo.vscode-django"
vscode "bierner.comment-tagged-templates"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "JakeBecker.elixir-ls"
vscode "James-Yu.latex-workshop"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "KevinRose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-selfhost-test-provider"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
vscode "ocamllabs.ocaml-platform"
vscode "Orta.vscode-jest"
vscode "phoenixframework.phoenix"
vscode "PKief.material-icon-theme"
vscode "RDebugger.r-debugger"
vscode "redhat.java"
vscode "REditorSupport.r"
vscode "ritwickdey.LiveServer"
vscode "runem.lit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "Shopify.ruby-lsp"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wholroyd.jinja"
vscode "wingrunr21.vscode-ruby"
vscode "xaver.clang-format"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "ziglang.vscode-zig"
vscode "ziyasal.vscode-open-in-github"
