tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "keith/formulae"
tap "yt-dlp/taps"
brew "age"
brew "antibody"
brew "atool"
brew "bat"
brew "python@3.10"
brew "zstd"
brew "borgbackup"
brew "borgmatic"
brew "chezmoi"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cpanminus"
brew "exa"
brew "ffmpeg"
brew "findutils"
brew "fisher"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "htop"
brew "httpie"
brew "jq"
brew "mas"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "opam"
brew "parallel"
brew "perl"
brew "pipx"
brew "r"
brew "rbenv"
brew "rclone"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "tealdeer"
brew "tig"
brew "tmux"
brew "topgrade"
brew "tree"
brew "vim"
brew "zx"
brew "keith/formulae/dyld-shared-cache-extractor"
brew "yt-dlp/taps/yt-dlp"
cask "alt-tab"
cask "appcleaner"
cask "discord"
cask "docker"
cask "eclipse-java"
cask "eloston-chromium"
cask "firefox"
cask "font-cascadia-code-pl"
cask "font-fantasque-sans-mono"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-input"
cask "font-iosevka"
cask "font-iosevka-ss17"
cask "font-mononoki"
cask "font-recursive"
cask "font-recursive-code"
cask "font-smoothing-adjuster"
cask "ghidra"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboardcleantool"
cask "kitty"
cask "librewolf"
cask "mactex"
cask "mambaforge"
cask "postman"
cask "setapp"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
